app/Controllers/DaftarController.php

INSERT INTO `users` (`username`, `password`) VALUES ('paisss', '$2y$10$oneGBNnFQHcctQUHgWgFFeagPHcbqDsoQiVW7yVG.PteI4ixXprp2')
---
    public function process()
    {
        helper(['form', 'url']);
        $validation = \Config\Services::validation();

        // Aturan validasi
        $validation->setRules([
            'username' => 'required|min_length[3]|is_unique[users.username]',
            'password' => 'required|min_length[6]'
        ]);

        // Validasi input
        if (!$this->validate($validation->getRules())) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // Menyimpan data pengguna
        $userModel = new UserModel();
        $data = [
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ];

        if ($userModel->insert($data)) {